Revit 2027 API
StairsRun.StairsRunStyle Property
 The style of the stairs run such as straight, winder, etc.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsRunStyle StairsRunStyle { get; }
Public ReadOnly Property StairsRunStyle As StairsRunStyle
	Get
public:
property StairsRunStyle StairsRunStyle {
	StairsRunStyle get ();
}
member StairsRunStyle : StairsRunStyle with get
Property Value
StairsRunStyle
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace